driver-tests/bpelse/samples/samplesJBI/test/simpleEcho/Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:echo="http://www.sun.com/sample-service/echo">
  <soapenv:Body>
    <echo:item>
      <value>Hello World</value>
    </echo:item>
  </soapenv:Body>
</soapenv:Envelope>