driver-tests/bpelse/samples/samplesJBI/test/results/simpleEcho/Actual_20130325142831_S.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <echo:item xmlns:echo="http://www.sun.com/sample-service/echo" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
      <value>Hello World</value>
    </echo:item>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>